const inventory = [];
let room = "вход";

function showInventory() {
    if (inventory.length === 0) {
        alert("Рюкзак пуст.");
    } else {
        alert("В рюкзаке: " + inventory.join(", "));
    }
}

alert(
    "ТАЙНЫ СТАРОГО ОСОБНЯКА\n\n" +
    "Уже несколько десятилетий жители окрестных деревень обходят " +
    "старый особняк стороной. Говорят, что по ночам в его окнах " +
    "появляется свет, хотя хозяева давно покинули это место.\n\n" +
    "Сегодня ты получила письмо без обратного адреса. " +
    "Внутри была лишь одна фраза:\n\n" +
    "«Он скоро проснётся. Если хочешь узнать правду, приходи до полуночи».\n\n" +
    "Ты стоишь перед дверью особняка. Часы показывают без пяти двенадцать.\n" +
    "Тебе предстоит найти склеп древнего вампира, раскрыть тайну семьи " +
    "Сальваторе и собрать предметы, необходимые для победы.\n\n" +
    "Но будьте осторожны: в этом доме не всё является тем, чем кажется."
);

while (true) {

    // вход
    if (room === "вход") {
        const choice = prompt(
            "ВХОД В ОСОБНЯК\n\n" +
            "Тяжёлая дверь медленно приоткрывается сама собой.\n" +
            "Изнутри доносится тихий шёпот, словно кто-то произносит твоё имя.\n\n" +
            "1 — Войти в главный холл\n" +
            "2 — Проверить рюкзак\n" +
            "0 — Покинуть особняк");

    }

}